<template>
  <view>
    <button class="btn btn1" @click="checkTo()">系统介绍</button>
    <button class="btn" @click="canTo()">功能介绍</button>

    <view class="title">
      {{ title }}
    </view>
    <view class="word2"> {{word2}} </view>
    <view class="word2"> {{word3}} </view>
    <view class="word2"> {{word4}} </view>
    <view class="word2"> {{word5}} </view>
    <view class="word2"> {{word6}} </view>
    <view class="word2"> {{word7}} </view>

  </view>
</template>

<script>
export default {
  data() {
    return {
      title: "功能",
      word1:
        "食品安全涉及千家万户，关系到人民群众的身体健康，关系到经济健康发展和社会稳定。由于缺乏有效的手段，检测的流程没有系统化，从而导致很多问题层出不穷，例如检测资源浪费，检测资源信息分割、部门间重复抽检等现象十分突出，监管手段难以形成快速反应机制。建立统一的食品安全送检体系，做好送检流程，完善送检机制，搞好食品质量管理，提高食品突发事件快速反应能力必须依靠信息化手段。建立“食品安全检验检测信息共享平台”，有效整合各监管部门检测数据，实现相互沟通和信息共享，已成为加强食品安全监管一种有效的手段。",
      title2: "我们的建设目标",
      word2:
        "1、多功能信息采集功能（1）食品安全多功能信息采集主要是对食品的检测报告数据进行采集，检测报告包含前导信息、样品信息、环节信息、抽样信息、基本检测信息、结论信息等。采集的方式主要有手工录入、接口传输和批量与单个导入三种。（2）手工录入是指监测单位在系统中直接将检测报告内容进行手工录入并提交审核。（3）接口传输是指各监测单位从目前已有的信息系统或监测终端中通过数据接口传输到信息共享平台中。（4）批量与单个导入是指系统支持批量检测报告的导入功能，录入人员可将符合一定格式要求的检测报告批量导入系统。（5）检测类型主要有快检、法检、监督抽检、风险评估等多种检测类型。",
      word3:
        "2、信息自动化预警功能（1）食品安全信息自动化预警主要分为预警管理、预警提示、预警信息发布管理、预警信息查询。（2）预警管理中还分为预警警报管理和预警条件管理。预警警报管理主要包括了对预警警报的分类分级以及对各级预警警报的设定。预警条件管理主要是指由各监测单位根据自己部门对食品监测的情况对本部门预警条件进行设置，定义部门预警级别。（3）预警信息发布主要分为根据部门内部预警条件的预警信息发布和根据系统预警警报级别的预警信息发布。预警信息可在平台内及卫生相关网站发布、以系统对接的形式发送至各管理部门办公系统或者以信息推送的形式向相关人员发送预警短信。（4）预警信息查询主要是指具有查看权限人员可以在平台内进行条件查询，相关网站上发布的预警信息进行查询。",
      word4:
        "3、综合信息管理（1）综合信息管理主要有用户管理、权限管理、统计报表、信息发布、信息审核、信息查询、信息推送、工作量考核等。（2）用户管理：按权限对系统内所有用户进行信息管理，包括对用户的姓名、性别、手机号码、邮箱地址、所属部门、职位、系统内账户名称、系统内角色等信息的添加、修改和删除。角色包含录入、审核、公布、查阅、管理员等。（3）信息发布：可对基层单位、监管相对人、消费者以及内部人员通过平台发布有关食品安全信息。包括检测报告单、检测项目结果、平台公告、投诉及建议等的发布。（4）信息审核：对各检测机构报送的信息进行统一审核，需审核信息报送本部门审核权限负责人。提供批量审批和逐个审批的自选功能。（5）统计报表：按地区、单位，按年度、季度、月度，按检测项目、食品种类、受检产品所在区域、生产单位所在区域，按受检所在环节等统计检测报告的合格数、不合格数、合格率、不合格率等数据。对于统计结果中每一个统计结果能够进一步列出具体的检测报告。（6）工作量考核：对检测机构检测报告上传数、录入数、公布数以及错误发生次数和处理及时度，要求生成检测任务考核表、检测结果考核报表、预警信息考核报表、食品检测质量考核表等。",
      word5:
        "4、关联业务系统对接食品安全检测主要涉及到各地食品综合监管平台以及相关部门（包括市级食品药品监督管理部门、卫生部门、农业部门、工商行政管理部门、质量技术监督部门、出入境检验检疫部门）。食品安全监测预警信息共享平台需完成与上述相关业务系统的对接，并协助各部门完成目前现有的业务系统的改造。（1）数据标准化，整合各部门检测报告，统一为标准化报告。为后续监测预警、综合评估打好基础。（2）各检测部门业务系统与食品安全监测预警信息共享平台建立信息接口，自动在两套系统之间完成数据交互，实现一次保存，存储两套应用系统功能。（3）预警信息共享，通过数据共享平台建立共享通道，满足系统无缝切换需求，实现对食品的监督管理。",
      word6:
        "5、统一通信支撑系统的使用预警信息、办公信息、政策信息在平台中发布时，需要同时以短信的形式将预警信息、办公信息、政策信息发送到相关人员手机上。目前主流的通信运营商包括电信、移动和联通，为保证信息及时、正常的将信息送到所有用户手中，需要使用统一的通信服务系统，实现短信全覆盖服务功能，保证信息及时推送。在信息发布时，可同时以短信的形式将预警信息、办公信息、政策信息发送到相关人员手机上。可扩展性的门户框架。网站前台相关功能主要是综合发布系统，网站中一些栏目，如：机构职能、政策法规、监管动态、监管公告、要闻播报、消费警示、热点聚焦、饮食文化、企业之窗、名优产品等，都可通过内容发布平台进行动态维护。",
      word7:
        "6、扩展功能要求（1）关联业务系统对接功能：各部门现有业务系统需进行数据标准化改造，统一为标准化检测报告，建立各检测部门业务系统与市食品安全监测预警信息共享平台信息接口，自动在两套系统之间完成数据交互，实现一次保存，满足无缝切换。（2）满足后续多终端设备支持：支持设备终端主要包含了移动设备查验系统、快速检验车查验系统、智能手机软件查询系统、WAP查询系统、食品安全管理门户、数字电视发布系统、短信发布系统。（3）满足后续数字地图系统支持：支持苏州市规划局数字化地理信息系统的接口调用，包括区域预警、检验和被检单位GIS标注、基础信息展现等复合地理功能。 ",
    };
  },
  methods: {
    canTo(){
        uni.navigateTo({ url: './can' })
    },
    checkTo(){
        uni.navigateTo({ url: './check' })
    }
  },
};
</script>
<style scoped>
.title {
  flex: auto;
  display: flex;
  flex-direction: column;
  justify-content: center;
  align-items: center;
  font-size: 18px;
  margin: 8px;
  font-style: inherit;
}
.word1 {
  text-indent: 30px;
  padding: 0px 20px;
  line-height: 30px;
  border-bottom: 1px solid rgb(136, 132, 132);
}
.word2{
    text-indent: 30px;
  padding: 0px 20px;
  line-height: 30px;
}
.btn {
  display: flex;
  width: 50%;
  justify-content: center;
  align-items: center;
  height: 40px;
  line-height: 40px;
}
.btn1 {
  float: left;
}
</style>